{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "nb_row": 5, "trainable": true, "subsample": [2, 2], "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "nb_col": 5, "W_regularizer": null, "border_mode": "valid", "bias": true, "nb_filter": 24}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.3, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 36, "trainable": true, "subsample": [2, 2], "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "bias": true, "nb_row": 5}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.3, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 48, "trainable": true, "subsample": [2, 2], "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "bias": true, "nb_row": 5}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.3, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "name": "convolution2d_4", "b_regularizer": null, "nb_filter": 64, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "bias": true, "nb_row": 3}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.3, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "name": "convolution2d_5", "b_regularizer": null, "nb_filter": 64, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "bias": true, "nb_row": 3}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 100, "activation": "linear", "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_2", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 50, "activation": "linear", "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_3", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "activation": "linear", "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_4", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 1, "activation": "linear", "input_dim": null, "bias": true}}]}